КанцОптТорг/src/Documents/ЗаполнениеГрафикаПредприятия/ЗаполнениеГрафикаПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаполнениеГрафикаПредприятия</name>
  <registerRecords>InformationRegister.ГрафикПредприятия</registerRecords>
</mdclass:Document>

КанцОптТорг/src/InformationRegisters/ГрафикПредприятия/ГрафикПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикПредприятия</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КанцОптТорг/src/Documents/ЗаполнениеГрафикаПредприятия/ObjectModule.bsl
Процедура ОбработкаПроведения (Отказ, РежимПроведения)
	
	ТекущаяДата = НачалоГода(Дата);
	КонецГода = КонецГода(Дата);
	
	Движения.ГрафикПредприятия.Записывать = Истина;
	
	Пока ТекущаяДата <= КонецГода цикл
		
		Движение = 	Движения.ГрафикПредприятия.Добавить();
		Движение.Дата = ТекущаяДата;
		ДеньНедели = ДеньНедели(ТекущаяДата);
		Движение.РабочийДень = 1;
		Если ДеньНедели <=5 Тогда
			Движение.РабочийДень = 1;
		Иначе
			Движение.РабочийДень = 0;
			КонецЕсли;
		
		ТекущаяДата = ТекущаяДата + 24*3600;
		
		КонецЦикла;
		
	
КонецПроцедуры
